notes/org/summer.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="theme/style.min.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css"/>
#+HTML_HEAD: <script id="MathJax-script" async src="https://cdn.jsdelivr.net/npm/mathjax@3/es5/tex-mml-chtml.js"></script>
#+TITLE:    CISC 3140
#+SUBTITLE:  Design and Implementation of Software Applications 2
#+SUBTITLE:  Department of Computer & Information Science, Brooklyn College
#+AUTHOR:    Katherine Chuang
#+EMAIL:     chuang@sci.brooklyn.cuny.edu
#+UNIVERSITY: Brooklyn College
#+DEPARTMENT: Department of CIS

#+EXPORT_FILE_NAME: ../html/index.html

#+OPTIONS:   H:3 num:n toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+ALT_TITLE: Lecture Notes

* Introduction to Summer course
:PROPERTIES:
:UNNUMBERED: toc
:END:

This is the summer version of the course that is condensed to 5 weeks. In the *Lecture Notes* section below, each module is meant to be covered during 1 week of the course. Within each module are between 3-5 topics, each with a set of /Learning Objectives/ and /Activities/ outlined.

The contents of this document is intended to serve both students who are taking the course and the instructor re-teaching the course.


* Logistics
:PROPERTIES:
:UNNUMBERED: toc
:CUSTOM_ID: logistics
:END:
#+OPTIONS: toc:2
#+TOC: tables

** Course schedules
#+TOC: headlines local

This section describes how the learning modules are structured, correlating to each week.

*** Weekly Outcomes
:PROPERTIES:
:UNNUMBERED: toc
:END:

Typically in a week there are certain required activities a student must complete to show minimal engagement with the course material:

+ *Open book quiz* to ensure students knows where to reference materials for that week (Friday)
+ *Reflective activity* based on lecture and reading (Sunday)
+ *Homework assignment* related to the module (Tuesday)

#+CAPTION: Course Schedule
|-------+------------------------------------------------------------------+-----------------------------------|
| Week  | Module                                                           | Assessments                       |
|-------+------------------------------------------------------------------+-----------------------------------|
| <c5>  | <l30>                                                            |                                   |
|   1   | Module 1 Introduction to Software Teams                          | Discussion based on reading, Quiz |
|   2   | Module 2 Managing Software Projects. Building Software as a Team | Collaborative Activity, Quiz      |
|   3   | Module 3 Importance of Specifications                            | Collaborative Activity, Quiz      |
|   4   | Module 4 Web Technology & Software Construction                  | Collaborative Activity, Quiz      |
|   5   | Module 5 Web design & Software Delivery                          | Collaborative Activity, Quiz      |
| Final |                                                                  | Cumulative Exam                   |
|-------+------------------------------------------------------------------+-----------------------------------|




/Instructor note/ This weekly "checkpoint" structure seems to work well for the because there are a vast number of "new things" that the students are learning in this course for the first time ever. Weekly checks are constructed to ensure different levels of cognition are utilized with the course material. Due dates are spread over different days to aid in student's time management abilities and also to help with the workflow of grading turnaround time.
*** Design of Homework Activities

The first homework assignment focuses on the challenges of communication and more specifically, shared decision making "on the fly" without any communication policies in place. The rest of the homeworks are more technical in nature, meaning the student will have to practice looking for and reading technical documents to complete certain suggested tasks.


** Grades and Points allocation

