notes/html/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-07-19 Sun 13:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CISC 3140</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Katherine Chuang" />
<link rel="stylesheet" type="text/css" href="theme/style.min.css"/>
<link rel="stylesheet" type="text/css" href="style.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CISC 3140
<br />
<span class="subtitle">Design and Implementation of Software Applications 2 Department of Computer &amp; Information Science, Brooklyn College</span>
</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org556cd4b">Introduction to Summer course</a></li>
<li><a href="#logistics">Logistics</a>
<ul>
<li><a href="#orgdb849b9">Course schedules</a>
<ul>
<li><a href="#org0f73bc9">Weekly Outcomes</a></li>
<li><a href="#org6bdee82">Design of Homework Activities</a></li>
</ul>
</li>
<li><a href="#orgf91ffc8">Grades and Points allocation</a>
<ul>
<li><a href="#org20bdf96">Required activities</a></li>
<li><a href="#org34d942e">Extra Credit activities</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc61ced4">Learning Modules</a>
<ul>
<li><a href="#m1">Module 1 Introduction to Software Teams</a>
<ul>
<li><a href="#orga64d1a0">Topic 1: What is Software</a></li>
<li><a href="#orgac128cf">Topic 2: Engineering Discipline</a></li>
<li><a href="#org8a465f2">Topic 3: Software Teams (Structures)</a></li>
</ul>
</li>
<li><a href="#m2">Module 2 Managing Software Projects</a>
<ul>
<li><a href="#orgc41c894">Topic 4: Process</a></li>
<li><a href="#org74fa22d">Topic 5: Project Estimations</a></li>
<li><a href="#org8476627">Topic 6: Terminal</a></li>
<li><a href="#orgb544612">Topic 7: Configuration Management</a></li>
<li><a href="#org849f410">Topic 8: VCS and Release Management</a></li>
</ul>
</li>
<li><a href="#m3">Module 3 Importance of Specifications</a>
<ul>
<li><a href="#org135af92">Topic 9: Specifications and other technical documents</a></li>
<li><a href="#org8a0f29f">Topic 10: Programming paradigms are different ways to express problems in code</a></li>
<li><a href="#org21aae83">Topic 11: Functional &amp; declarative way with Scheme</a></li>
<li><a href="#org0f3ac4c">Topic 12: Scripting Languages and barebones intro to JavaScript</a></li>
</ul>
</li>
<li><a href="#m4">Module 4 Web Technology &amp; Software Construction</a>
<ul>
<li><a href="#orge5f56e9">Topic 13: Specifications and other technical documents</a></li>
<li><a href="#org7dfc01e">Topic 14: Web Development and HTTP Protocol</a></li>
<li><a href="#orgf761b7b">Topic 15: Separating Content from Presentation</a></li>
</ul>
</li>
<li><a href="#m5">Module 5 Web design &amp; Software Delivery</a>
<ul>
<li><a href="#org99eb97d">Topic 16: HTML continued, maybe intro to Web  Scraping</a></li>
<li><a href="#orgeed1040">Topic 17: Continuous Integration for Automated Testing</a></li>
<li><a href="#orgb8466e1">Topic 18: Software Testing and measuring development and other quality metrics</a></li>
</ul>
</li>
<li><a href="#org2fe4db5">Summary</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org556cd4b" class="outline-2">
<h2 id="org556cd4b">Introduction to Summer course</h2>
<div class="outline-text-2" id="text-org556cd4b">
<p>
This is the summer version of the course that is condensed to 5 weeks. In the <b>Lecture Notes</b> section below, each module is meant to be covered during 1 week of the course. Within each module are between 3-5 topics, each with a set of <i>Learning Objectives</i> and <i>Activities</i> outlined.
</p>

<p>
The contents of this document is intended to serve both students who are taking the course and the instructor re-teaching the course.
</p>
</div>
</div>


<div id="outline-container-orgf6479cf" class="outline-2">
<h2 id="logistics">Logistics</h2>
<div class="outline-text-2" id="text-logistics">
<div id="list-of-tables">
<h2>List of Tables</h2>
<div id="text-list-of-tables">
<ul>
<li><span class="table-number">Table 1:</span> Course Schedule</li>
<li><span class="table-number">Table 2:</span> Summary of scored activities each week</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdb849b9" class="outline-3">
<h3 id="orgdb849b9">Course schedules</h3>
<div class="outline-text-3" id="text-orgdb849b9">
<div id="text-table-of-contents">
<ul>
<li><a href="#org0f73bc9">Weekly Outcomes</a></li>
<li><a href="#org6bdee82">Design of Homework Activities</a></li>
</ul>
</div>

<p>
This section describes how the learning modules are structured, correlating to each week.
</p>
</div>

<div id="outline-container-org0f73bc9" class="outline-4">
<h4 id="org0f73bc9">Weekly Outcomes</h4>
<div class="outline-text-4" id="text-org0f73bc9">
<p>
Typically in a week there are certain required activities a student must complete to show minimal engagement with the course material:
</p>

<ul class="org-ul">
<li><b>Open book quiz</b> to ensure students knows where to reference materials for that week (Friday)</li>
<li><b>Reflective activity</b> based on lecture and reading (Sunday)</li>
<li><b>Homework assignment</b> related to the module (Tuesday)</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> Course Schedule</caption>

<colgroup>
<col  class="org-center" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Week</th>
<th scope="col" class="org-left">Module</th>
<th scope="col" class="org-left">Assessments</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-left">Module 1 Introduction to Software Teams</td>
<td class="org-left">Discussion based on reading, Quiz</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-left">Module 2 Managing Software Projects. Building Software as a Team</td>
<td class="org-left">Collaborative Activity, Quiz</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-left">Module 3 Importance of Specifications</td>
<td class="org-left">Collaborative Activity, Quiz</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-left">Module 4 Web Technology &amp; Software Construction</td>
<td class="org-left">Collaborative Activity, Quiz</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-left">Module 5 Web design &amp; Software Delivery</td>
<td class="org-left">Collaborative Activity, Quiz</td>
</tr>

<tr>
<td class="org-center">Final</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Cumulative Exam</td>
</tr>
</tbody>
</table>




<p>
<i>Instructor note</i> This weekly "checkpoint" structure seems to work well for the because there are a vast number of "new things" that the students are learning in this course for the first time ever. Weekly checks are constructed to ensure different levels of cognition are utilized with the course material. Due dates are spread over different days to aid in student's time management abilities and also to help with the workflow of grading turnaround time.
</p>
</div>
</div>
<div id="outline-container-org6bdee82" class="outline-4">
<h4 id="org6bdee82">Design of Homework Activities</h4>
<div class="outline-text-4" id="text-org6bdee82">
<p>
The first homework assignment focuses on the challenges of communication and more specifically, shared decision making "on the fly" without any communication policies in place. The rest of the homeworks are more technical in nature, meaning the student will have to practice looking for and reading technical documents to complete certain suggested tasks.
</p>
</div>
</div>
</div>


<div id="outline-container-orgf91ffc8" class="outline-3">
<h3 id="orgf91ffc8">Grades and Points allocation</h3>
<div class="outline-text-3" id="text-orgf91ffc8">
</div>
