notes/org/summer.org
*** Required activities

Typically in a week there are certain required activities a student must complete to show minimal engagement with the course material:

+ Open book quiz to ensure students knows where to reference materials for that week (Friday)
+ An activity based on reflecting over the lecture and reading (Sunday)
+ Hands on homework assignment related to the module (Tuesday)

All items must be completed by their due dates for full points.


#+CAPTION: Summary of scored activities each week
|    Week    | Quiz | Homework | Discussion | Accumulating Total Points[fn:acc] |
|------------+------+----------+------------+-----------------------------------|
|    <c>     | <c>  |   <c>    |    <c>     |                                   |
|     1      |  8   |    8     |     1      |                                17 |
|     2      |  8   |    8     |     1      |                                   |
|     3      |  8   |    8     |     1      |                                   |
|     4      |  8   |    8     |     1      |                                   |
|     5      |  8   |    8     |     1      |                                   |
|------------+------+----------+------------+-----------------------------------|
| Final Exam |  15  |          |            |                               100 |
|------------+------+----------+------------+-----------------------------------|
|   Total    |      |          |            |                               100 |
|------------+------+----------+------------+-----------------------------------|

[fn:acc] The blank cells are left as an exercise for the student to practice estimating projects.

*** Extra Credit activities

The goal of extra credit is to enhance absorption of the course material, by allowing students to summarize their reading or class discussion activity to wiki pages.

The purpose of the wiki is to potentially serve as a study guide for the final exam at the end of the semester.


* Learning Modules
:PROPERTIES:
:UNNUMBERED: toc
:END:

#+OPTIONS: toc:3
#+TOC: headlines 1 local

** Module 1 Introduction to Software Teams
:PROPERTIES:
:UNNUMBERED: toc
:CUSTOM_ID: m1
:END:

#+TOC: headlines 3 local


In this first week, we focus on the world of software development as a whole.

In lecture 1, we start with what is software, what is the purpose of software, and why is software created? By whom? For whom? These are some of the questions to think about why a software project exists, to better understand the overall context.

Next in lecture 2 we start looking at the role of the software development team and some of the challenges they face in delivering quality. This is to help you start reflecting about what you know relating to software development today.

In lecture 3 we start looking at the software team, how the structure of team organization relates to collaborating on project(s).

This week is more focused on communication. There are no programming assignments, but instead there is a group activity where you discuss with your group to try making a group decision.

*** Topic 1: What is Software

**** Learning Objectives
This course covers the tools and techniques for large scale software development.

***** What is software? What is considered large-scale software?

***** What makes large-scale software more challenging than a mini software project?

***** What are qualities of a senior software engineer?

**** Activities

***** Lecture [[https://docs.google.com/presentation/d/1iZ4JECgPQwAJDCw3PJkySlBYmSsb0rSM9_kkzrME3d8/edit][What is Software?]] covers the relationship of software to business goals. Software production (especially the lucrative variety) is often done in order to achieve business aims. There are open source software projects as well that focus on non-capitalistic goals.
***** Read [[https://link.springer.com/article/10.1007/s10664-017-9524-2][Exploring software development at the very large-scale: a revelatory case study and research agenda for agile method adaptation]] to understand large-scale software concerns (at minimum, the introduction section)
***** Watch [[https://www.youtube.com/watch?v=JxkEkWpo6Vw][Difference between Application and System Software]]. This video describes two common categories of software. In this class we're focusing more on the production of application (end user) software, and using some system software to achieve the end goal.

*** Topic 2: Engineering Discipline

**** Learning Objectives

*** Topic 3: Software Teams (Structures)


** Module 2 Managing Software Projects
:PROPERTIES:
:CUSTOM_ID: m2
:UNNUMBERED: TOC
:END:


This week we dive into building software as a team - the challenges and some of the approaches to manage complexity. and in particular some practices in managing software projects. The topics in this module focuses on the various processes that a team or individuals on a team might use to align themselves to work together (such as techniques to agree on policies or milestones, or more technically like how to share files and developing environments).

Proposed schedule of completion is as follows, however feel free to read ahead.

- Before Monday: Lectures 4 & 5
- Before Tuesday: Lecture 6
- Before Wednesday: Lecture 7
- Before Thursday: Lecture 8


*** Topic 4: Process

**** Learning Objectives

***** Importance of Process in producing consistency and with quality

***** Where Software Engineering and SDLC come from

***** Software Engineering principles

**** Activities

***** Lecture: Process in Software Engineering
***** Read No Silver Bullets to understand the author's ideas about different areas of complexities in software development, and identify some of the solutions.
***** Read A Brief History of Software Engineering  to understand the evolution of programming languages over time. Such as how was 1960 different than the decades following?
***** Read Chapter 1 of Seriously Good Software (read more chapters if you have time!) - read enough to understand how the author would go about measuring software quality

*** Topic 5: Project Estimations

**** Learning Objectives

