notes/html/index.html
<div id="outline-container-org20bdf96" class="outline-4">
<h4 id="org20bdf96">Required activities</h4>
<div class="outline-text-4" id="text-org20bdf96">
<p>
Typically in a week there are certain required activities a student must complete to show minimal engagement with the course material:
</p>

<ul class="org-ul">
<li>Open book quiz to ensure students knows where to reference materials for that week (Friday)</li>
<li>An activity based on reflecting over the lecture and reading (Sunday)</li>
<li>Hands on homework assignment related to the module (Tuesday)</li>
</ul>

<p>
All items must be completed by their due dates for full points.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Summary of scored activities each week</caption>

<colgroup>
<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-center" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-center">Week</th>
<th scope="col" class="org-center">Quiz</th>
<th scope="col" class="org-center">Homework</th>
<th scope="col" class="org-center">Discussion</th>
<th scope="col" class="org-right">Accumulating Total Points<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-center">1</td>
<td class="org-center">8</td>
<td class="org-center">8</td>
<td class="org-center">1</td>
<td class="org-right">17</td>
</tr>

<tr>
<td class="org-center">2</td>
<td class="org-center">8</td>
<td class="org-center">8</td>
<td class="org-center">1</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-center">3</td>
<td class="org-center">8</td>
<td class="org-center">8</td>
<td class="org-center">1</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-center">4</td>
<td class="org-center">8</td>
<td class="org-center">8</td>
<td class="org-center">1</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-center">5</td>
<td class="org-center">8</td>
<td class="org-center">8</td>
<td class="org-center">1</td>
<td class="org-right">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-center">Final Exam</td>
<td class="org-center">15</td>
<td class="org-center">&#xa0;</td>
<td class="org-center">&#xa0;</td>
<td class="org-right">100</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-center">Total</td>
<td class="org-center">&#xa0;</td>
<td class="org-center">&#xa0;</td>
<td class="org-center">&#xa0;</td>
<td class="org-right">100</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org34d942e" class="outline-4">
<h4 id="org34d942e">Extra Credit activities</h4>
<div class="outline-text-4" id="text-org34d942e">
<p>
The goal of extra credit is to enhance absorption of the course material, by allowing students to summarize their reading or class discussion activity to wiki pages.
</p>

<p>
The purpose of the wiki is to potentially serve as a study guide for the final exam at the end of the semester.
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgc61ced4" class="outline-2">
<h2 id="orgc61ced4">Learning Modules</h2>
<div class="outline-text-2" id="text-orgc61ced4">
<div id="text-table-of-contents">
<ul>
<li><a href="#m1">Module 1 Introduction to Software Teams</a></li>
<li><a href="#m2">Module 2 Managing Software Projects</a></li>
<li><a href="#m3">Module 3 Importance of Specifications</a></li>
<li><a href="#m4">Module 4 Web Technology &amp; Software Construction</a></li>
<li><a href="#m5">Module 5 Web design &amp; Software Delivery</a></li>
<li><a href="#org2fe4db5">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2d3462e" class="outline-3">
<h3 id="m1">Module 1 Introduction to Software Teams</h3>
<div class="outline-text-3" id="text-m1">
<div id="text-table-of-contents">
<ul>
<li><a href="#orga64d1a0">Topic 1: What is Software</a></li>
<li><a href="#orgac128cf">Topic 2: Engineering Discipline</a></li>
<li><a href="#org8a465f2">Topic 3: Software Teams (Structures)</a></li>
</ul>
</div>


<p>
In this first week, we focus on the world of software development as a whole.
</p>

<p>
In lecture 1, we start with what is software, what is the purpose of software, and why is software created? By whom? For whom? These are some of the questions to think about why a software project exists, to better understand the overall context.
</p>

<p>
Next in lecture 2 we start looking at the role of the software development team and some of the challenges they face in delivering quality. This is to help you start reflecting about what you know relating to software development today.
</p>

<p>
In lecture 3 we start looking at the software team, how the structure of team organization relates to collaborating on project(s).
</p>

<p>
This week is more focused on communication. There are no programming assignments, but instead there is a group activity where you discuss with your group to try making a group decision.
</p>
</div>

<div id="outline-container-orga64d1a0" class="outline-4">
<h4 id="orga64d1a0">Topic 1: What is Software</h4>
<div class="outline-text-4" id="text-orga64d1a0">
</div>
<ul class="org-ul">
<li><a id="org072af0f"></a>Learning Objectives<br />
<div class="outline-text-5" id="text-org072af0f">
<p>
This course covers the tools and techniques for large scale software development.
</p>
</div>

<ul class="org-ul">
<li><a id="org174b3e4"></a>What is software? What is considered large-scale software?<br /></li>

<li><a id="orga03f1c4"></a>What makes large-scale software more challenging than a mini software project?<br /></li>

<li><a id="orgd527969"></a>What are qualities of a senior software engineer?<br /></li>
</ul>
</li>

<li><a id="org0df136e"></a>Activities<br />
<ul class="org-ul">
<li><a id="orgebdd23a"></a>Lecture <a href="https://docs.google.com/presentation/d/1iZ4JECgPQwAJDCw3PJkySlBYmSsb0rSM9_kkzrME3d8/edit">What is Software?</a> covers the relationship of software to business goals. Software production (especially the lucrative variety) is often done in order to achieve business aims. There are open source software projects as well that focus on non-capitalistic goals.<br /></li>
<li><a id="orgd2a7a4a"></a>Read <a href="https://link.springer.com/article/10.1007/s10664-017-9524-2">Exploring software development at the very large-scale: a revelatory case study and research agenda for agile method adaptation</a> to understand large-scale software concerns (at minimum, the introduction section)<br /></li>
<li><a id="org711cf49"></a>Watch <a href="https://www.youtube.com/watch?v=JxkEkWpo6Vw">Difference between Application and System Software</a>. This video describes two common categories of software. In this class we're focusing more on the production of application (end user) software, and using some system software to achieve the end goal.<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-orgac128cf" class="outline-4">
<h4 id="orgac128cf">Topic 2: Engineering Discipline</h4>
<div class="outline-text-4" id="text-orgac128cf">
</div>
<ul class="org-ul">
<li><a id="org878bf04"></a>Learning Objectives<br /></li>
</ul>
</div>

<div id="outline-container-org8a465f2" class="outline-4">
<h4 id="org8a465f2">Topic 3: Software Teams (Structures)</h4>
</div>
</div>


<div id="outline-container-org393f6e5" class="outline-3">
<h3 id="m2">Module 2 Managing Software Projects</h3>
<div class="outline-text-3" id="text-m2">
<p>
This week we dive into building software as a team - the challenges and some of the approaches to manage complexity. and in particular some practices in managing software projects. The topics in this module focuses on the various processes that a team or individuals on a team might use to align themselves to work together (such as techniques to agree on policies or milestones, or more technically like how to share files and developing environments).
</p>

<p>
Proposed schedule of completion is as follows, however feel free to read ahead.
</p>

<ul class="org-ul">
<li>Before Monday: Lectures 4 &amp; 5</li>
<li>Before Tuesday: Lecture 6</li>
<li>Before Wednesday: Lecture 7</li>
<li>Before Thursday: Lecture 8</li>
</ul>
</div>


<div id="outline-container-orgc41c894" class="outline-4">
<h4 id="orgc41c894">Topic 4: Process</h4>
<div class="outline-text-4" id="text-orgc41c894">
</div>
<ul class="org-ul">
<li><a id="org45b944b"></a>Learning Objectives<br />
<ul class="org-ul">
<li><a id="org6c490a1"></a>Importance of Process in producing consistency and with quality<br /></li>

<li><a id="org5102c53"></a>Where Software Engineering and SDLC come from<br /></li>

<li><a id="org4861636"></a>Software Engineering principles<br /></li>
</ul>
</li>

<li><a id="orgb0babf6"></a>Activities<br />
<ul class="org-ul">
<li><a id="org6270ef4"></a>Lecture: Process in Software Engineering<br /></li>
<li><a id="orgcb18c5d"></a>Read No Silver Bullets to understand the author's ideas about different areas of complexities in software development, and identify some of the solutions.<br /></li>
<li><a id="org0be8ce6"></a>Read A Brief History of Software Engineering  to understand the evolution of programming languages over time. Such as how was 1960 different than the decades following?<br /></li>
<li><a id="org77d0992"></a>Read Chapter 1 of Seriously Good Software (read more chapters if you have time!) - read enough to understand how the author would go about measuring software quality<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org74fa22d" class="outline-4">
<h4 id="org74fa22d">Topic 5: Project Estimations</h4>
<div class="outline-text-4" id="text-org74fa22d">
</div>
<ul class="org-ul">
