notes/org/summer.org
***** General purpose of project planning

***** Gathering requirements

***** Importance of Specifications

**** Activities

***** Lecture: [[https://docs.google.com/presentation/d/1SFDq6ux2jE5FUB6d8bTIrEBfssEoqHNQsidlXYo8yRQ/edit?usp=sharing][Project Estimations]]

***** Read: Software Tools and Techniques Report - just enough to get a sense of general layout of the report, and also so you have an idea of why it was published. The author describes motivations for the report.

***** Read: Successful Software Management Style: Steering and Balance - to get a sense of various considerations given to managing projects


*** Topic 6: Terminal

**** Learning Objectives

***** Introduction to the terminal

***** Accessing the manual page for a software

***** Navigating the manual page

***** Introduction to SSH

**** Activities

***** Lecture: [[https://docs.google.com/presentation/d/1ZGXvpvWRFXwgvU2iRDcjHbH3WHM8M5LNRc1SAkM3DCs/edit?usp=sharing][Terminal]]

***** For those who are new to the terminal environment and need a little more guidance than the lecture, start with [[https://missing.csail.mit.edu/2020/course-shell/][Lecture 1 from Missing Semester of CS]] to understand what is the shell, and how to navigate it.
***** /Suggested for those who do not have unix/linux access already or are new to installing software by command-line/, try accessing BC's Web Lab Linux Server using SSH (link to instructions). The homework assignment will required the command line interface (CLI).
Discussion board


*** Topic 7: Configuration Management

**** Learning Objectives

**** Activities

*** Topic 8: VCS and Release Management

**** Learning Objectives

**** Activities

** Module 3 Importance of Specifications
:PROPERTIES:
:UNNUMBERED: TOC
:CUSTOM_ID: m3
:END:


This module focuses on the different kinds of documents to see how technical information is structured and presented. We'll focus more on a type of document called a specification. Technical writing is an art, it helps to see different examples. From this week until the end you'll be referencing different kinds of documents to get good at picking out key details.

Alongside this theme we'll also look at different programming paradigms to see how problems can be expressed in different kinds of abstractions.

*** Topic 9: Specifications and other technical documents



**** Learning Objectives

**** Activities

***** Slides Specifications and other technical documents

***** Read Pages 1-4 of The Algol 60 Report

***** Discussion Activity

*** Topic 10: Programming paradigms are different ways to express problems in code

Programming is about abstraction. There are different kinds of abstractions than Object Oriented programming.

**** Learning Objectives

**** Activities

***** Lecture: Programming Paradigms, Functional & Declarative Programming
***** Read: Programming Paradigms for Dummies: What Every Programmer Should Know
***** Post to discussion board

*** Topic 11: Functional & declarative way with Scheme

Scheme is a programming language with many variations.

**** Learning Objectives

**** Activities

*** Topic 12: Scripting Languages and barebones intro to JavaScript

**** Learning Objectives

**** Activities

** Module 4 Web Technology & Software Construction
:PROPERTIES:
:UNNUMBERED: TOC
:CUSTOM_ID: m4
:END:

*** Topic 13: Specifications and other technical documents

**** Learning Objectives

**** Activities

***** Lecture Slides

*** Topic 14: Web Development and HTTP Protocol

*** Topic 15: Separating Content from Presentation


** Module 5 Web design & Software Delivery
:PROPERTIES:
:UNNUMBERED: TOC
:CUSTOM_ID: m5
:END:

*** Topic 16: HTML continued, maybe intro to Web  Scraping

*** Topic 17: Continuous Integration for Automated Testing

*** Topic 18: Software Testing and measuring development and other quality metrics

** Summary
:PROPERTIES:
:UNNUMBERED: toc
:END:

To summarize the course in a short one-liner for each week:

Module 1: Collaboration is challenging. Communication is challenging.

Module 2: There are many practices and tools to collaborate effectively.

Module 3: Technical documentation comes in all forms to cover all kinds of technical inventions... RTFM.

Module 4: Programming is to plumbing as software development is running a restaurant.

Module 5: Delivery is juggling end user needs and quality.
