notes/html/index.html
<li><a id="orgb8e435f"></a>Learning Objectives<br />
<ul class="org-ul">
<li><a id="org6e5ec42"></a>General purpose of project planning<br /></li>

<li><a id="org74ac6b2"></a>Gathering requirements<br /></li>

<li><a id="org47221a7"></a>Importance of Specifications<br /></li>
</ul>
</li>

<li><a id="org1fb2d34"></a>Activities<br />
<ul class="org-ul">
<li><a id="org2acde46"></a>Lecture: <a href="https://docs.google.com/presentation/d/1SFDq6ux2jE5FUB6d8bTIrEBfssEoqHNQsidlXYo8yRQ/edit?usp=sharing">Project Estimations</a><br /></li>

<li><a id="org1cad637"></a>Read: Software Tools and Techniques Report - just enough to get a sense of general layout of the report, and also so you have an idea of why it was published. The author describes motivations for the report.<br /></li>

<li><a id="org3c303e0"></a>Read: Successful Software Management Style: Steering and Balance - to get a sense of various considerations given to managing projects<br /></li>
</ul>
</li>
</ul>
</div>


<div id="outline-container-org8476627" class="outline-4">
<h4 id="org8476627">Topic 6: Terminal</h4>
<div class="outline-text-4" id="text-org8476627">
</div>
<ul class="org-ul">
<li><a id="org917bc09"></a>Learning Objectives<br />
<ul class="org-ul">
<li><a id="org60a5312"></a>Introduction to the terminal<br /></li>

<li><a id="org21e2b99"></a>Accessing the manual page for a software<br /></li>

<li><a id="orga592dba"></a>Navigating the manual page<br /></li>

<li><a id="org4934ab4"></a>Introduction to SSH<br /></li>
</ul>
</li>

<li><a id="orgfb89e70"></a>Activities<br />
<ul class="org-ul">
<li><a id="org6a174f7"></a>Lecture: <a href="https://docs.google.com/presentation/d/1ZGXvpvWRFXwgvU2iRDcjHbH3WHM8M5LNRc1SAkM3DCs/edit?usp=sharing">Terminal</a><br /></li>

<li><a id="orgd727fa0"></a>For those who are new to the terminal environment and need a little more guidance than the lecture, start with <a href="https://missing.csail.mit.edu/2020/course-shell/">Lecture 1 from Missing Semester of CS</a> to understand what is the shell, and how to navigate it.<br /></li>
<li><a id="orgfe82fb4"></a><i>Suggested for those who do not have unix/linux access already or are new to installing software by command-line</i>, try accessing BC's Web Lab Linux Server using SSH (link to instructions). The homework assignment will required the command line interface (CLI).<br />
<div class="outline-text-6" id="text-orgfe82fb4">
<p>
Discussion board
</p>
</div>
</li>
</ul>
</li>
</ul>
</div>


<div id="outline-container-orgb544612" class="outline-4">
<h4 id="orgb544612">Topic 7: Configuration Management</h4>
<div class="outline-text-4" id="text-orgb544612">
</div>
<ul class="org-ul">
<li><a id="orgaac489e"></a>Learning Objectives<br /></li>

<li><a id="orga2e3e15"></a>Activities<br /></li>
</ul>
</div>

<div id="outline-container-org849f410" class="outline-4">
<h4 id="org849f410">Topic 8: VCS and Release Management</h4>
<div class="outline-text-4" id="text-org849f410">
</div>
<ul class="org-ul">
<li><a id="orgb03d115"></a>Learning Objectives<br /></li>

<li><a id="orgd2e2927"></a>Activities<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org50c3e0d" class="outline-3">
<h3 id="m3">Module 3 Importance of Specifications</h3>
<div class="outline-text-3" id="text-m3">
<p>
This module focuses on the different kinds of documents to see how technical information is structured and presented. We'll focus more on a type of document called a specification. Technical writing is an art, it helps to see different examples. From this week until the end you'll be referencing different kinds of documents to get good at picking out key details.
</p>

<p>
Alongside this theme we'll also look at different programming paradigms to see how problems can be expressed in different kinds of abstractions.
</p>
</div>

<div id="outline-container-org135af92" class="outline-4">
<h4 id="org135af92">Topic 9: Specifications and other technical documents</h4>
<div class="outline-text-4" id="text-org135af92">
</div>
<ul class="org-ul">
<li><a id="orgfab5773"></a>Learning Objectives<br /></li>

<li><a id="org71a6c92"></a>Activities<br />
<ul class="org-ul">
<li><a id="orgd52dd38"></a>Slides Specifications and other technical documents<br /></li>

<li><a id="org031446e"></a>Read Pages 1-4 of The Algol 60 Report<br /></li>

<li><a id="org586c70d"></a>Discussion Activity<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org8a0f29f" class="outline-4">
<h4 id="org8a0f29f">Topic 10: Programming paradigms are different ways to express problems in code</h4>
<div class="outline-text-4" id="text-org8a0f29f">
<p>
Programming is about abstraction. There are different kinds of abstractions than Object Oriented programming.
</p>
</div>

<ul class="org-ul">
<li><a id="orgcd9f0c7"></a>Learning Objectives<br /></li>

<li><a id="orga1d0943"></a>Activities<br />
<ul class="org-ul">
<li><a id="org03cb116"></a>Lecture: Programming Paradigms, Functional &amp; Declarative Programming<br /></li>
<li><a id="org68acf91"></a>Read: Programming Paradigms for Dummies: What Every Programmer Should Know<br /></li>
<li><a id="org1495bcd"></a>Post to discussion board<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org21aae83" class="outline-4">
<h4 id="org21aae83">Topic 11: Functional &amp; declarative way with Scheme</h4>
<div class="outline-text-4" id="text-org21aae83">
<p>
Scheme is a programming language with many variations.
</p>
</div>

<ul class="org-ul">
<li><a id="org812122f"></a>Learning Objectives<br /></li>

<li><a id="orge37081c"></a>Activities<br /></li>
</ul>
</div>

<div id="outline-container-org0f3ac4c" class="outline-4">
<h4 id="org0f3ac4c">Topic 12: Scripting Languages and barebones intro to JavaScript</h4>
<div class="outline-text-4" id="text-org0f3ac4c">
</div>
<ul class="org-ul">
<li><a id="org09b206d"></a>Learning Objectives<br /></li>

<li><a id="org550b861"></a>Activities<br /></li>
</ul>
</div>
</div>

<div id="outline-container-orgcacb208" class="outline-3">
<h3 id="m4">Module 4 Web Technology &amp; Software Construction</h3>
<div class="outline-text-3" id="text-m4">
</div>

<div id="outline-container-orge5f56e9" class="outline-4">
<h4 id="orge5f56e9">Topic 13: Specifications and other technical documents</h4>
<div class="outline-text-4" id="text-orge5f56e9">
</div>
<ul class="org-ul">
<li><a id="org1f7554d"></a>Learning Objectives<br /></li>

<li><a id="org143f442"></a>Activities<br />
<ul class="org-ul">
<li><a id="org6d95bc1"></a>Lecture Slides<br /></li>
</ul>
</li>
</ul>
</div>

<div id="outline-container-org7dfc01e" class="outline-4">
<h4 id="org7dfc01e">Topic 14: Web Development and HTTP Protocol</h4>
</div>

<div id="outline-container-orgf761b7b" class="outline-4">
<h4 id="orgf761b7b">Topic 15: Separating Content from Presentation</h4>
</div>
</div>


<div id="outline-container-orgee5de13" class="outline-3">
<h3 id="m5">Module 5 Web design &amp; Software Delivery</h3>
<div class="outline-text-3" id="text-m5">
</div>

<div id="outline-container-org99eb97d" class="outline-4">
<h4 id="org99eb97d">Topic 16: HTML continued, maybe intro to Web  Scraping</h4>
</div>

<div id="outline-container-orgeed1040" class="outline-4">
<h4 id="orgeed1040">Topic 17: Continuous Integration for Automated Testing</h4>
</div>

<div id="outline-container-orgb8466e1" class="outline-4">
<h4 id="orgb8466e1">Topic 18: Software Testing and measuring development and other quality metrics</h4>
</div>
</div>

<div id="outline-container-org2fe4db5" class="outline-3">
<h3 id="org2fe4db5">Summary</h3>
<div class="outline-text-3" id="text-org2fe4db5">
<p>
To summarize the course in a short one-liner for each week:
</p>

<p>
Module 1: Collaboration is challenging. Communication is challenging.
</p>

<p>
Module 2: There are many practices and tools to collaborate effectively.
</p>

<p>
Module 3: Technical documentation comes in all forms to cover all kinds of technical inventions&#x2026; RTFM.
</p>

<p>
Module 4: Programming is to plumbing as software development is running a restaurant.
</p>

<p>
Module 5: Delivery is juggling end user needs and quality.
</p>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
The blank cells are left as an exercise for the student to practice estimating projects.
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: Katherine Chuang</p>
<p class="date">Created: 2020-07-19 Sun 13:29</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
